/*
Navicat MySQL Data Transfer

Source Server         : 本地
Source Server Version : 50631
Source Host           : localhost:3306
Source Database       : blog

Target Server Type    : MYSQL
Target Server Version : 50631
File Encoding         : 65001

Date: 2016-12-08 21:23:22
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for blog_ability
-- ----------------------------
DROP TABLE IF EXISTS `blog_ability`;
CREATE TABLE `blog_ability` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '编号',
  `fruit` char(20) NOT NULL COMMENT '果实',
  `uid` mediumint(8) DEFAULT NULL COMMENT '用户id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of blog_ability
-- ----------------------------
INSERT INTO `blog_ability` VALUES ('2', '无', '3');
INSERT INTO `blog_ability` VALUES ('3', '橡胶果实', '2');

-- ----------------------------
-- Table structure for blog_experience
-- ----------------------------
DROP TABLE IF EXISTS `blog_experience`;
CREATE TABLE `blog_experience` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '编号',
  `title` varchar(50) NOT NULL COMMENT '经历标题',
  `content` text NOT NULL COMMENT '经历内容',
  `uid` mediumint(8) DEFAULT NULL COMMENT '用户id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of blog_experience
-- ----------------------------
INSERT INTO `blog_experience` VALUES ('1', '东海', '&lt;p&gt;&lt;strong&gt;路飞打败&lt;/strong&gt;了黑猫海贼团、克利克海贼团及恶龙海贼团，救了索隆、乌索普、山治和娜美，这份拼上性命的诚意感动并成功邀请到他们入伙。 打败了阿龙之后，路飞被悬赏3000万贝里。 路飞的&amp;ldquo;草帽海贼团&amp;rdquo;正式成型，路飞一行人分别说出自己的梦想，前往伟大航路。&lt;/p&gt;\n', '2');
INSERT INTO `blog_experience` VALUES ('2', '阿拉巴斯坦篇', '草帽一伙进入伟大航路后，一行人来到威士忌山峰，与奈菲鲁塔丽·薇薇相遇并决意帮助这位公主返回国家阿拉巴斯坦。\r\n因为娜美生病，草帽一伙来到医疗大国磁鼓王国寻找医生，磁鼓王国的人民攻击路飞他们，路飞生气地想要反击，被薇薇拦下并教育，于是路飞和薇薇一起向磁鼓王国的人民磕头请求医生救他的伙伴。\r\n在找医生的途中，路飞穿着单薄的衣服，背着娜美和山治两人在漫天大雪中徒手爬上五千米的雪山，几乎冻伤的他上去后第一句话就是“他们是我的伙伴”。\r\n在病好后，路飞对托尼托尼·乔巴产生了极大兴趣，执意要拉它入伙。舍身守护乔巴重视的海贼旗，告诉乔巴“我就是你的伙伴。”路飞最终打败当地暴虐统治的国王，邀请到乔巴加入。[18] \r\n路飞一伙和艾斯相遇。[19] \r\n路飞一伙救起了Mr.2，并在双方都不知对方是敌方的情况成为朋友。后小冯为路飞一伙和薇薇之间的友情所感动，牺牲自己救了路飞一伙。\r\n在前往阻止反叛军叛乱的途中，路飞认识到问题的重点，决意找沙·克洛克达尔算账。路飞也坦然地告诉薇薇“人本来就会死”，并让她“把我们的命都赌上，因为我们是伙伴啊！”\r\n路飞百折不挠地向沙·克洛克达尔挑战，最终利用沙怕水的弱点战胜了沙·克洛克达尔，救起了罗宾和阿拉巴斯坦原国王，路飞的悬赏金额激升至1亿贝里。路飞一伙邀请薇薇加入，薇薇感谢并最终选择了拒绝。为了不拖累薇薇，路飞一伙只能沉默告别。大家背对薇薇，举起手臂，展示X标识，以此方式向薇薇告别。\r\n在船上罗宾因为无家可归要求路飞加入草帽海贼团然后在路飞的同意下罗宾加入。', '2');
INSERT INTO `blog_experience` VALUES ('3', '空岛篇', '&lt;p&gt;路飞为了敲响黄金钟，以免下面的库力克大叔潜水到死，并为了拯救受恐怖统治的空岛人民，利用果实相克的属性打败了艾尼路，并结束当地历经四百年的战争。&lt;/p&gt;\n', '2');
INSERT INTO `blog_experience` VALUES ('4', '司法岛篇', '路飞一行人来到水之七岛，打算利用空岛得到的黄金翻修严重受损的梅丽号，却得知梅丽号已经无法继续航行。为了保全船员的性命，路飞最终决定舍弃旧船，为此引发了和乌索普之间的争执和战斗。战胜乌索普后，路飞默默地向乌索普表示感谢，失去了梅丽和乌索普的路飞终于忍不住流下泪来。[23] \r\n乌索普以“狙击王”身份乔装回归，只有乔巴和路飞没有认出他来。\r\n面对罗宾的离开真相，路飞当机立断下令追回罗宾。路飞一伙来到政府要地“司法岛”，不惜向世界政府宣战，要求罗宾说“我要活下去”。在战斗中，为了保护伙伴，路飞的潜力被激发，开发出了“二档”和“三档”，战胜了布鲁诺，在苦斗的情形下战胜了罗布·路奇。路飞的赏金升至3亿贝里。[24] \r\n路飞一伙人被梅丽号救起，但船只受损更加严重。路飞亲手点火烧毁了前进梅丽号，就此结束它的使命。\r\n火烧梅利号\r\n火烧梅利号\r\n在梅利号的船精灵开口向路飞一伙道谢后，路飞忍不住大哭，对梅利号说对不起。[25] \r\n路飞听从弗兰奇小弟的计划，成功拉弗兰奇加入。路飞一伙人拥有了新船万里阳光号。\r\n路飞想要去接想回归的乌索普，被索隆为了维护威信而拦住，于是路飞在船上等乌索普前来道歉而忍了三天不出去，在出航时路飞终于听到乌索普的真心道歉，喜极而泣将乌索普拉回船上。', '2');
INSERT INTO `blog_experience` VALUES ('5', '恐怖三桅帆船篇', '路飞一伙人和呆在“幽灵船”的布鲁克相遇，在什么都不知道的情况下路飞邀请布鲁克\r\n路飞和奥兹\r\n路飞和奥兹\r\n成为伙伴，两人非常合得来，路飞要求帮他夺回影子。[4] \r\n路飞全副武装准备去冒险，被乌索普吐槽得了冒险准备齐全症。\r\n见到地狱狗后路飞想要驯服它，被其一口咬住，路飞温柔地让它松口后后，怒喝一声一拳打昏塞帕拉斯，塞帕拉斯最终成为路飞坐骑。见到会说话的树和独角兽后，路飞先是震惊，后立刻去追逐抓住那颗树，想要它成为伙伴，被众人大吼。\r\n由于众人影子被夺走，路飞一伙拼死和莫利亚战斗，最终获得胜利。\r\n大战后路飞筋疲力尽陷入昏迷，巴索罗米·熊打算取下路飞首级，最终因为索隆挺身而出放过路飞。[27]  知道事情的人为了不让路飞愧疚而都对路飞保密。路飞为了庆祝布鲁克入团而开宴会，稍后因为当时索隆不在，又开了一场。', '2');
INSERT INTO `blog_experience` VALUES ('14', '香波地群岛篇', '路飞一伙人为了给船只镀膜前往鱼人岛而来到了香波地群岛，和凯米，帕帕克，夏琪相识并成为朋友。\r\n夏琪告诉路飞，过亿的路飞等新人成为十一名超新星。在这十一人当中路飞的悬赏金排名第二。\r\n路飞因为朋友小八被天龙人攻击，而愤怒地重伤天龙人，引发海军讨伐。雷利出现，赞扬路飞很适合那顶草帽。路飞等三大船长出去对阵海军，带领各自的海贼团逃跑。\r\n失去伙伴的路飞\r\n失去伙伴的路飞\r\n路飞等人听了雷利关于海贼王的故事，路飞感到极其兴奋，后来大声地阻止乌索普问雷利关于One Piece的事并用自己不当海贼相威胁，对雷利说出了自己对“海贼王”的定义。\r\n主犯路飞一伙人受到黄猿、战桃丸及“和平主义者”的围攻，路飞立刻认识到事态对自己这一方不利，于是立即下令让大家分散逃跑，并约定三天后回到桑尼号上。但路飞一伙被巴索罗米·熊分别弹飞，路飞为自己保护不了伙伴而流泪。', '2');
INSERT INTO `blog_experience` VALUES ('15', '女儿岛篇', '路飞被弹飞到掉落到女儿岛，在乱吃东西后身上长满蘑菇，意识不清，被玛格莉特所救。\r\n在无意看到汉库克的秘密后，女帝决意要杀死路飞，于是路飞和波雅·桑达索尼亚，波雅·玛丽哥鲁德展开战斗，在无意间展示了“霸王色霸气”，并最终取胜。在波雅三姐妹的秘密要被暴露之时路飞上前替她们守住了这个秘密，三姐妹为之动容。\r\n女帝告诉了路飞背上的秘密，知道了路飞殴打了天龙人，并因为路飞表示讨厌天龙人而终于放下心防，喜欢上了路飞，并同意协助他前往“海底大监狱”营救哥哥艾斯。', '2');
INSERT INTO `blog_experience` VALUES ('16', '海底监狱篇', '路飞藏在汉库克的衣服里，乘坐海军军舰到达大监狱，在汉库克的能力协助下顺利潜入监狱内部并通过身体检查。\r\n独自寻找艾斯的路飞在level1遇上巴基，路飞把藏有藏宝图的手环给了巴基，\r\n路飞一伙人越狱\r\n路飞一伙人越狱\r\n来到了level2遇上Mr.3，接着来到了level3遇上Mr.2。对于level1-3的狱卒兽，路飞都能独自秒杀。\r\n在四人被迫共同作战，用计击败level4的狱卒兽后，路飞独自对上麦哲伦。由于麦哲伦果实的能力，路飞处于守势，最终路飞冒险转为攻势，但由于实力差距过大而败北，身受多种毒素折磨，被扔进level5。\r\n路飞被Mr.2救出，在逃出level5的途中路飞挣扎起来发出霸王色霸气震昏雪狼，两人被闪电救起。路飞凭着残存的意识，请求人妖王救Mr.2，这种请求震惊了人妖王，人妖王决定救助两人。路飞以十年寿命为代价换取生存，被人妖王绑住锁链关在房间，痛苦地喊叫了整整20个小时。这是为了赶上艾斯的处刑，路飞仅用了二十个小时就完成与死神的战斗，让人妖王看到了奇迹。路飞跪谢Mr.2，无意中向人妖王透露了自己的身世，被注射兴奋柯尔蒙。\r\n路飞与人妖王和闪电一同前往level6，但未能及时赶上押送队伍。于是他们解放了沙·克洛克达尔、甚平，和level较底层的犯人合作逃狱。在最后路飞和Mr.3合作对抗麦哲伦拖延时间，后来请求Mr.2一起出逃无果后哭着道别。', '2');
INSERT INTO `blog_experience` VALUES ('17', '顶上战争篇', '路飞和其他逃狱者从天而降进入本部，路飞在找到艾斯的身影后大喊艾斯的名字，艾斯拼命劝阻让路飞回去，路飞不听从。\r\n沙·克洛克达尔企图袭击白胡子被路飞挡下，路飞和白胡子进行了平等对谈。路飞得到了白胡子的赏识，后白胡子让队长们掩护路飞。汉库克偷偷将艾斯手铐的钥匙交给路飞，鹰眼挡在了路飞的面前并动真格。后路飞得到巴基和花剑比斯塔的掩护。路飞跳上行刑台被三大将拦下并败北。\r\n倒下的路飞再次央求人妖王为他注入亢奋荷尔蒙，后在众人的掩护下再次冲往处刑台，并在艾斯即将被处刑时展现了霸王色霸气。普通状态下路飞一拳击退使用剃的克比和最终于心不忍出手的爷爷，挡住了战国元帅的攻击，在Mr.3的协助下解救艾斯成功，二人瞬即共同战斗。\r\n为了捡艾斯的生命卡，路飞被赤犬突袭，结果被艾斯用身体挡下。路飞震惊地抱着重伤的艾斯，听完了艾斯的遗言，路飞大哭并精神崩溃失去意识倒地。\r\n3D2Y\r\n3D2Y\r\n马尔科为路飞挡下赤犬的攻击，要求队长们守护路飞，并请求甚平护送路飞离开，但甚平和路飞仍遭到赤犬重创，从此路飞胸口上留下一个巨大的X型伤疤。特拉法尔加·罗带路飞与甚平逃离现场并进行治疗。\r\n事隔两周后路飞终于恢复意识，但仍无法接受艾斯的死亡，哭着大吼自己的弱小，拖着受伤的身体在女儿岛丛林到处乱跑破坏东西，整个人变得颓废消极，甚至与甚平打架。经过甚平一番警醒，路飞想起了自己的伙伴，哭着表示好想见他们，终于决定重新振作起来。\r\n雷利来找路飞，向路飞提出了建议。路飞，甚平和雷利再次来到毫无准备的海军本部，他们夺下了一艘军舰并环绕马林梵多一周进行“水葬之礼”，之后路飞敲响了“奥克斯大钟”16下，并在战争后留下的大裂缝扔下花束，取下草帽举在胸前默哀，然后三人撤退。其实这是路飞为伙伴们传达右臂上的“3D2Y”信息。\r\n路飞开始师从雷利学习霸气。', '2');
INSERT INTO `blog_experience` VALUES ('18', '鱼人岛篇', '路飞对鱼人岛的冒险满心兴奋，无论是遇到海流，火山喷发，“幽灵船”，海兽等，他都是开心地笑着，大叫好玩太酷，虽然众人又害怕又紧张到压根没人吐槽他，但路飞真心的开心笑容无疑多少都能缓解众人的紧张和害怕\r\n路飞在鱼人岛\r\n路飞在鱼人岛(18张)\r\n。\r\n桑尼号下潜后，路飞等人为了抓鱼而准备出招，被乔巴和乌索普揍了一顿。\r\n在进入鱼人岛前，路飞一伙人被新鱼人海贼团带着几头海兽拦下，路飞拒绝成为其手下的要求并对其做鬼脸。进入鱼人岛后，路飞一行人再度被海流冲散，路飞和其他几人被凯米等人救起并参观鱼人岛。路飞被“人鱼咖啡厅”的店长夏莉预言是会毁了“鱼人岛”的元凶。\r\n由于路飞等人之前击败了小鱿，顺手救下了梅卡洛，使其得以脱困并通报尼普顿。当尼普顿为了表示感谢而准备设宴款待他们时，路飞跟着食物的香味进入白星的房间，在无意间惊醒白星。因路飞随意打开大门的缘故，使范德戴肯九世的斧头飞入，路飞保护了白星。\r\n白星公主向路飞求救，路飞一伙从梅加洛嘴里出现，路飞一击击飞霍迪·琼斯。路飞与新鱼人海贼团正式开战，路飞用霸王色霸气震晕了新鱼人海贼团5万余人，霸气地对霍迪·琼斯表示海贼王有一人就足够。最终霍迪被路飞击败。\r\n路飞为了停下诺亚，用不断流血的身体发动加速流血的三档，在“诺亚”被海王类停下后，说了句太好了然后昏迷。被甚平的血救醒后，路飞郑重地邀请甚平加入，但被甚平暂时拒绝。\r\n路飞等人用见闻色霸气感知到了白星有危险并及时赶到，卡里布被路飞一脚踢了下去。\r\n由于鱼人岛点心没了，BIG MAM很生气，扬言要毁灭鱼人岛，因此路飞向四皇“BIG MAM”宣战，扬言到时候要在新世界击败她，并将鱼人岛划归为自己的地盘。\r\n路飞一伙准备启程离开，路飞郑重地和甚平对视并告别，白星对路飞许下往后不再爱哭的承诺，路飞一伙和白星拉勾。', '2');
INSERT INTO `blog_experience` VALUES ('19', '庞克哈萨德篇', '路飞和罗结盟，预谋拉下一个四皇。为了引出M·凯撒·库朗背后的那位四皇，两人决定先抓住凯撒，而路飞负责抓获凯撒，罗则负责破坏SAD 。\r\n之后路飞抓住了凯撒并与他展开激战 ，战斗途中凯撒放出的剧毒瓦斯对路飞没什么效果，反而被路飞以武装色霸气压着打而处于下风，但凯撒使出无空世界击败路飞。\r\n路飞闯进研究室，重击凯撒，但遭到莫奈出手阻拦，后敲破地板掉入研究所深处的垃圾场。遇见了误食人造恶魔果实而突变成小龙的桃之助，从桃之助口中得知被囚禁的小孩们的遭遇后，在桃之助的帮助下逃离垃圾场，与众人会合，救下了重伤的茶胡子，并把凯撒重创打飞，将之捕捉擒拿。让罗借此逼迫唐吉诃德·多弗朗明哥放弃“七武海”地位。然而当多弗朗明哥通过电话虫和罗交涉释放的时间、地点、附加条件的时候，路飞迳自抢过话筒和多弗朗明哥发话，因为听见对方手里有着自己极度渴求的物品所吸引，险些遭对方诱惑，但由于罗、乌索普、乔巴及时制止才没有中计。', '2');
INSERT INTO `blog_experience` VALUES ('20', '德雷斯罗萨篇', '船只抵达德雷斯罗萨后，路飞本欲乘上变成龙的桃之助前往目的地，却因为桃之助的拒绝，转而和索隆、山治、弗兰克、锦卫门组成小队，负责调查“SMILE”工厂的所在处并将其摧毁。未几，一行人在餐厅歇脚的期间，碰巧撞见一帮恶棍在附设赌场设局欺负藤虎，路飞出面为“藤虎”打抱不平，令后者施展霸气瞬间击败在场所有恶棍，将餐厅地面轰出了大窟窿。透过恶棍的转告，获悉多弗朗明哥将艾斯身故后重生的“烧烧果实 ”做为竞技场的冠军奖品，为了取回艾斯的“遗物”，路飞化名路西潜入竞技场参加竞赛。\r\n路飞成为C区小组赛冠军。\r\n路飞目击多弗朗明哥和“藤虎”带着失去意识的罗前往皇宫。想要寻找会场出口，遇见巴托洛米奥，以及遭迪亚曼迪旗下杀手德林杰重创的贝拉密，与以为已死的萨博重逢，其后交换身分。随后路飞，索隆和锦卫门三人汇合，经由维奥莱特的领路，前往皇宫营救被掳走的罗。\r\n看见萨波时的惊讶表情\r\n看见萨波时的惊讶表情\r\n在经过了一系列激战过后，最终只剩下罗、路飞与多弗朗明哥。在此期间，路飞因对抗贝拉密而被拖住，罗已被折磨成重伤。路飞与明哥的战斗再度展开，路飞开启了必杀技——四档，[28]  将明哥一顿痛打。被痛打后的明哥使用了果实能力的更高一层境界——“觉醒”，但是还是被路飞打飞钉在墙上。路飞打算继续追击，但是由于四档的消耗太大，四档状态结束。明哥趁机准备去给路飞最后的一击。此时加兹及时赶到，得知了路飞四档过后是10分钟内无法使用霸气，与路飞说定能将明哥一击KO后，加兹背起路飞，开始帮忙逃脱并且拖延时间，同时在当时竞技场的选手们也一起帮忙拖延时间。巴沙斯突然从半路杀出，准备杀掉路飞。萨博及时赶到，开始与巴沙斯对抗。鸟笼的收缩时间也开始加快，经过一路奔波终于成功的拖够了10分钟。罗用ROOM将当时被线缠住的维奥莱特替换过来，挡住了被操纵的蕾贝卡的斩击，至此明哥与路飞的最终之战就此开始。路飞开启四档后，飞到空中，同时明哥也跟着飞到空中，路飞拼尽全力利用3档再度强化了自己的拳头使出了“大·猿王枪”向明哥打去，明哥使出了“十六发神圣凶弹·神诛杀”来抵挡，最终抵挡不住被打入地中。[29]  路飞也因为战斗过度立马变回常态虚弱的躺在地上，鸟笼逐渐的消失，证明路飞终于打败了多弗朗明哥，结束了多弗朗明哥在德雷斯罗萨中这10年的血腥统治。路飞在众人的欢呼声和蕾贝卡激动的泪水中欣慰的笑了。\r\n打败多佛后，路飞等人在居鲁士的家中休养，因为藤虎摇骰子连续摇出“1点”关系才得以连续休息了三天，但是到了第四天的早上，通过巴托洛米奥的情报得知已经退役的前海军元帅——佛之战国与现任中将——鹤女士来到了德雷斯罗萨，这个时候藤虎邀请鹤女士摇一次，结果不是“1点”，藤虎履行诺言，倾动全力抓捕草帽一行人，而路飞在准备逃跑的时候突然停下来，决定带蕾贝卡去见居鲁士。父女团聚后，路飞逃跑到港口，见到藤虎后上来就是一个带有武装色硬化的三挡的一拳，并正式向大将藤虎宣战。在未战斗完时，路飞被海尔丁强制抓走停止战斗，同时德雷斯罗萨的民众们也跑到港口，这使藤虎无法对路飞等人下手。\r\n离开德岛后，所有受到了解救的新世界强者感念草帽一伙的救命之恩在约塔玛利亚大船团的巨舰上，喝下“义子之酒”，七组势力一起组成“草帽大船团”加入草帽麾下，路飞随后与众人摆宴庆贺。之后，草帽一伙的新悬赏发布，路飞的赏金涨到了5亿贝利。', '2');
INSERT INTO `blog_experience` VALUES ('21', '佐乌篇', '草帽一伙乘坐巴托洛米奥的船来到了佐乌岛。巴托等人离开后，路飞等人通过堪十郎的“升龙”登上了佐乌。路飞与先前到达佐乌的娜美，乔巴等人汇合，得知岛上的情况，并了解到山治和凯撒被与路飞同为超新星的卡彭·贝基带走。之后为了对付凯多，和罗、以锦卫门等人为首的和之国武士们、以犬岚公爵为首的毛茸茸公国战士组成海贼同盟。\r\n之后在杰克一伙袭击卓武时用见闻色霸气听到了巨象的心声，然后听到了桃之助向巨象下令反击。\r\n随后为了救回山治，和娜美、乔巴、布鲁克、毛茸茸公国的佩洛德、加洛特以及波克姆兹前往由四皇之一BIG MOM统治的蛋糕岛进发。在途中得知了革命军总基地巴尔迪戈被黑胡子一伙毁灭后曾一度为萨博担心。\r\n在前往蛋糕岛途中，曾因误食了有剧毒的铠虎鱼身中剧毒濒临死亡，在此时众人遇到了杰尔马66一伙的船，此时文斯默克家族的零玖施展能力治愈了路飞，众人继续向蛋糕岛进攻。', '2');
INSERT INTO `blog_experience` VALUES ('22', '万国篇', '众人先是来到了BIG MOM领地之一巧克力岛，并得知大妈旗下的三十四座岛屿全部都是和食物有关，而在巧克力城镇上大吃特吃，随后遇到了山治的未婚妻，也是夏洛特家族的布琳，与布琳约定会按照秘密路线前往蛋糕岛带走山治，但殊不知此时大妈已经知道了草帽一伙来到了她的领地，但是此时波克姆兹留下了“原路返回”的字样失踪，路飞等人却依然向目的地前进。到达目的地之后，陷入了一片奇异的森林，遭到夏洛特·布蕾、夏洛特·克力架的阻击，现已打败克力架。', '2');
INSERT INTO `blog_experience` VALUES ('27', '东海', '&lt;p&gt;索隆出海后，以捕捉通缉犯赚取奖金为生（因为路痴迷路了，回不了村子，又找不到&lt;a href=&quot;http://baike.baidu.com/subview/25021/12502244.htm&quot; target=&quot;_blank&quot;&gt;鹰眼&lt;/a&gt;，所以抓悬赏犯赚取生活费），因而获得&amp;ldquo;海贼猎人索隆&amp;rdquo;（海贼狩りのゾロ）的称号。这段期间，索隆曾被&lt;a href=&quot;http://baike.baidu.com/view/247650.htm&quot; target=&quot;_blank&quot;&gt;巴洛克工作社&lt;/a&gt;的原&lt;a href=&quot;http://baike.baidu.com/view/700631.htm&quot; target=&quot;_blank&quot;&gt;Mr.7&lt;/a&gt;邀请加入，不过他要求只要由他取代克洛克达尔的社长座位就愿意加入，这造成巴洛克工作社的反对，干掉了Mr.7。有一次，为了支付铁匠修剑的钱，而去打倒悬赏1千万贝里的山鲸迪克，同时约瑟夫和强尼两个赏金猎人对他甘拜下风，决定跟随索隆。&lt;/p&gt;\n\n&lt;p&gt;后来为了拯救女孩莉嘉而将海军的&lt;a href=&quot;http://baike.baidu.com/view/4775464.htm&quot; target=&quot;_blank&quot;&gt;蒙卡&lt;/a&gt;大佐的儿子&lt;a href=&quot;http://baike.baidu.com/view/734698.htm&quot; target=&quot;_blank&quot;&gt;贝鲁梅伯&lt;/a&gt;饲养的狼杀死，因此被海军拘捕，绑在海军基地的刑场上，不给食物和水。原先贝鲁梅伯答应只要索隆能活足一个月，就会释放他。但这是贝鲁梅伯的戏言，其实打算要公开处决他。路飞知道后决定帮助索隆，并让索隆成为他的伙伴。起初索隆拒绝&lt;a href=&quot;http://baike.baidu.com/subview/74486/16855373.htm&quot; target=&quot;_blank&quot;&gt;路飞&lt;/a&gt;，说不要成为一位海贼，但在克比的口中得知贝鲁梅伯要处决他后，为了实现与古伊娜的约定，决定成为路飞的伙伴。&lt;/p&gt;\n\n&lt;p&gt;再也不会输了&lt;/p&gt;\n\n&lt;p&gt;成为路飞的伙伴后，在前往&lt;a href=&quot;http://baike.baidu.com/view/733006.htm&quot; target=&quot;_blank&quot;&gt;伟大航道&lt;/a&gt;的旅途上，在&lt;a href=&quot;http://baike.baidu.com/view/2595433.htm&quot; target=&quot;_blank&quot;&gt;海上餐厅巴拉蒂&lt;/a&gt;遇上了现今的世界第一剑豪、&lt;a href=&quot;http://baike.baidu.com/view/108642.htm&quot; target=&quot;_blank&quot;&gt;王下七武海&lt;/a&gt;之一的鹰眼&lt;a href=&quot;http://baike.baidu.com/view/2280030.htm&quot; target=&quot;_blank&quot;&gt;乔拉可尔&amp;middot;米霍克&lt;/a&gt;。索隆向米霍克提出了挑战，但他的三刀流却敌不过只以十字架短剑应战的米霍克。即使被米霍克以短剑刺中心脏仍不退缩，被问及为何不后退？索隆回答道：&amp;ldquo;呵&amp;hellip;&amp;hellip;谁知道呢&amp;hellip;&amp;hellip;感觉只要我后退了一步&amp;hellip;&amp;hellip;很多重要的誓言和事情都会被破坏，好像再也不能回到这里了。&amp;rdquo;认为如果失败，还是死了痛快。因此受到米霍克的赏识，以剑士的礼仪，用世界最强黑刀击败他。索隆终究敌不过米霍克，身受重伤，除和道一文字以外的另外两把配刀亦被斩断。索隆在古伊娜逝世后初尝败绩，于此战中体会到能力的差异，同时向路飞发誓在击败米霍克成为世界第一剑士前绝对不会再输给任何一个剑士。&lt;/p&gt;\n\n&lt;p&gt;在罗格镇，遇上了和&lt;a href=&quot;http://baike.baidu.com/view/2336149.htm&quot; target=&quot;_blank&quot;&gt;古伊娜&lt;/a&gt;长得一模一样、同是用剑，隶属海军总部的&lt;a href=&quot;http://baike.baidu.com/view/734696.htm&quot; target=&quot;_blank&quot;&gt;达斯琪&lt;/a&gt;上士。并在当地的武器店，以自身的气魄抑制了妖刀&amp;ldquo;&lt;a href=&quot;http://baike.baidu.com/view/1246609.htm&quot; target=&quot;_blank&quot;&gt;三代鬼彻&lt;/a&gt;&amp;rdquo;的妖气，受到武器店老板的敬佩，后将传家宝快刀&amp;ldquo;&lt;a href=&quot;http://baike.baidu.com/view/1257112.htm&quot; target=&quot;_blank&quot;&gt;雪走&lt;/a&gt;&amp;rdquo;和三代鬼彻一并赠送于索隆。&lt;/p&gt;\n', '3');

-- ----------------------------
-- Table structure for blog_skill
-- ----------------------------
DROP TABLE IF EXISTS `blog_skill`;
CREATE TABLE `blog_skill` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '自动编号',
  `skill` char(20) NOT NULL COMMENT '招式名称',
  `uid` mediumint(8) DEFAULT NULL COMMENT '用户id',
  `aid` mediumint(8) DEFAULT NULL COMMENT '果实id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of blog_skill
-- ----------------------------
INSERT INTO `blog_skill` VALUES ('4', '三刀流系列', '3', '2');
INSERT INTO `blog_skill` VALUES ('5', '无刀流', '3', '2');
INSERT INTO `blog_skill` VALUES ('26', '二档', '2', '3');
INSERT INTO `blog_skill` VALUES ('27', '三档', '2', '3');
INSERT INTO `blog_skill` VALUES ('28', '四档', '2', '3');

-- ----------------------------
-- Table structure for blog_user
-- ----------------------------
DROP TABLE IF EXISTS `blog_user`;
CREATE TABLE `blog_user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '自动编号',
  `username` char(20) NOT NULL COMMENT '用户名',
  `password` char(40) NOT NULL COMMENT '密码',
  `face` char(200) DEFAULT NULL COMMENT '头像',
  `email` char(50) NOT NULL COMMENT '电子邮件',
  `create` int(10) NOT NULL COMMENT '注册时间',
  `last_login` int(10) NOT NULL COMMENT '最后登录时间',
  `last_ip` int(10) NOT NULL COMMENT '最后登录ip',
  `sex` char(1) DEFAULT NULL COMMENT '性别',
  `nickname` char(20) DEFAULT NULL COMMENT '绰号',
  `team` char(20) DEFAULT NULL COMMENT '海贼团',
  `location` char(10) DEFAULT NULL COMMENT '故乡',
  `organ` char(30) DEFAULT NULL COMMENT '口头禅',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of blog_user
-- ----------------------------
INSERT INTO `blog_user` VALUES ('2', '路飞', '7c222fb2927d828af22f592134e8932480637c0d', null, 'lufei@163.com', '1478780597', '1480731472', '0', '男', '草帽当家的', '草帽海贼团', '东海', '我是要成为海贼王的男人');
INSERT INTO `blog_user` VALUES ('3', '索隆', '7c222fb2927d828af22f592134e8932480637c0d', null, 'suolong@163.com', '1478781413', '1480428011', '0', '男', '绿藻头', '草帽海贼团', '东海', '成为世界第一大剑豪');
INSERT INTO `blog_user` VALUES ('4', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'shanzhi@163.com', '1478785588', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('5', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'qiaoba@163.com', '1478785812', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('6', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'wusuopu@163.com', '1478870715', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('7', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'fulanqi@163.com', '1478870800', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('8', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'namei@163.com', '1478914463', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('9', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'luobing@163.com', '1478916206', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('10', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'aisi@163.com', '1478917397', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('11', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'xiangkesi@163.com', '1478918768', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('12', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'buluke@163.com', '1478918963', '0', '0', '', '', '', '', '');
INSERT INTO `blog_user` VALUES ('13', '', '7c222fb2927d828af22f592134e8932480637c0d', null, 'admin@163.com', '1478936161', '0', '0', '', '', '', '', '');
SET FOREIGN_KEY_CHECKS=1;
